sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dac.c
/*!
    \file    gd32a7xx_dac.c
    \brief   DAC driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32a7xx_dac.h"

#define DAC_WATI_TIME_MASK          ((uint32_t)0x000000FFU)
#define DAC_STAT_FLAG_MASK0         (DAC_FLAG_LTOVIF | DAC_FLAG_LTDIF | DAC_FLAG_DDUDR0)
#define DAC_INT_EN_MASK0            (DAC_INT_DDUDR0)
#define DAC_INT_EN_MASK1            (DAC_INT_LTDIF | DAC_INT_LTOVIF)
#define DAC_INT_FLAG_MASK0          (DAC_INT_FLAG_DDUDR0)
#define DAC_INT_FLAG_MASK1          (DAC_INT_FLAG_LTOVIF | DAC_INT_FLAG_LTDIF)
#define DAC_REG_DEFAULT_VALUE       ((uint32_t)0x00000000U)

/*!
    \brief      deinitialize DAC (API_ID(0x0001U))
    \param[in]  dac_periph: DACx(x=0,1)
    \param[out] none
    \retval     none
*/
void dac_deinit(uint32_t dac_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0001), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DEN0);
        DAC_CTL0(dac_periph) = DAC_REG_DEFAULT_VALUE;
        DAC_SWT(dac_periph) = DAC_REG_DEFAULT_VALUE;
        DAC_OUT0_R12DH(dac_periph) = DAC_REG_DEFAULT_VALUE;
        DAC_OUT0_L12DH(dac_periph) = DAC_REG_DEFAULT_VALUE;
        DAC_OUT0_R8DH(dac_periph) = DAC_REG_DEFAULT_VALUE;
        DAC_OUT0_DO(dac_periph) = DAC_REG_DEFAULT_VALUE;
        DAC_STAT0(dac_periph) = DAC_REG_DEFAULT_VALUE;
        DAC_LTCTL(dac_periph) = DAC_REG_DEFAULT_VALUE;
        DAC_LTPAT(dac_periph) = DAC_REG_DEFAULT_VALUE;
        switch(dac_periph){
            case DAC0:
                /* assign default values to registers */
                /* reset DAC0 */
                rcu_periph_reset_enable(RCU_DAC0RST);
                rcu_periph_reset_disable(RCU_DAC0RST);
                break;
            case DAC1:
                /* assign default values to registers */
                /* reset DAC1 */
                rcu_periph_reset_enable(RCU_DAC1RST);
                rcu_periph_reset_disable(RCU_DAC1RST);
                break;
            default:
                break;
        }
    }
}

/*!
    \brief      enable DAC (API_ID(0x0002U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_out: DAC_OUTx(x=0)
    \param[out] none
    \retval     none
*/
void dac_enable(uint32_t dac_periph, uint8_t dac_out)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0002), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            DAC_CTL0(dac_periph) |= (uint32_t)DAC_CTL0_DEN0;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      disable DAC (API_ID(0x0003U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_out: DAC_OUTx(x=0)
    \param[out] none
    \retval     none
*/
void dac_disable(uint32_t dac_periph, uint8_t dac_out)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0003), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DEN0);
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      enable DAC DMA function (API_ID(0x0004U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_out: DAC_OUTx(x=0)
    \param[out] none
    \retval     none
*/
void dac_dma_enable(uint32_t dac_periph, uint8_t dac_out)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0004), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            DAC_CTL0(dac_periph) |= (uint32_t)DAC_CTL0_DDMAEN0;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      disable DAC DMA function (API_ID(0x0005U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_out: DAC_OUTx(x=0)
    \param[out] none
    \retval     none
*/
void dac_dma_disable(uint32_t dac_periph, uint8_t dac_out)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0005), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DDMAEN0);
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure GPIO connection (API_ID(0x0006U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_out: DAC_OUTx(x=0)
    \param[in]  gpio_connect: DAC_OUTx connect GPIO mode
                only one parameter can be selected which is shown as below:
      \arg        PIN_PERIPHERAL: DAC_OUTx(x=0) connected to the external pin and on chip peripherals(CMP)
      \arg        PIN_PERIPHERAL_BUFFER: Whether DAC_OUTx(x=0) is connected to external pin and on chip peripherals(CMP) depends on the output buffer
    \param[out] none
    \retval     none
*/
void dac_gpio_connect_config(uint32_t dac_periph, uint8_t dac_out, uint32_t gpio_connect)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0006), ERR_PERIPH);
    }else if (NOT_DAC_DDISC0(gpio_connect)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0006), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            /* configure GPIO connection */
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DDISC0);
            DAC_CTL0(dac_periph) |= gpio_connect;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      enable DAC output buffer (API_ID(0x0007U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_out: DAC_OUTx(x=0)
    \param[out] none
    \retval     none
*/
void dac_output_buffer_enable(uint32_t dac_periph, uint8_t dac_out)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0007), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DBOFF0);
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      disable DAC output buffer (API_ID(0x0008U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_out: DAC_OUTx(x=0)
    \param[out] none
    \retval     none
*/
void dac_output_buffer_disable(uint32_t dac_periph, uint8_t dac_out)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0008), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            DAC_CTL0(dac_periph) |= (uint32_t)DAC_CTL0_DBOFF0;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      get DAC output value (API_ID(0x0009U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_out: DAC_OUTx(x=0)
    \param[out] none
    \retval     DAC output data: 0~4095
*/
uint16_t dac_output_value_get(uint32_t dac_periph, uint8_t dac_out)
{
    uint16_t data = 0U;
    
