sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dac.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0009), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            /* store the DACx_OUT0 output value */
            data = (uint16_t)DAC_OUT0_DO(dac_periph);
        } else {
            /* illegal parameters */
        }
    }
    
    return data;
}

/*!
    \brief      set DAC data holding register value (API_ID(0x000AU))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_out: DAC_OUTx(x=0)
    \param[in]  dac_align: DAC data alignment mode
                only one parameter can be selected which is shown as below:
      \arg        DAC_ALIGN_12B_R: 12-bit right-aligned data
      \arg        DAC_ALIGN_12B_L: 12-bit left-aligned data
      \arg        DAC_ALIGN_8B_R: 8-bit right-aligned data
    \param[in]  data: data to be loaded(0~4095)
    \param[out] none
    \retval     none
*/
void dac_data_set(uint32_t dac_periph, uint8_t dac_out, uint32_t dac_align, uint16_t data)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000A), ERR_PERIPH);
    } else if(NOT_DAC_ALIGN(dac_align)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000A), ERR_PARAM_INVALID);
    } else if((DAC_ALIGN_12B_R == dac_align) && NOT_DAC_R12DATA_RANGE(data)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000A), ERR_PARAM_OUT_OF_RANGE);
    } else if((DAC_ALIGN_12B_L == dac_align) && NOT_DAC_L12DATA_RANGE(data)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000A), ERR_PARAM_OUT_OF_RANGE);
    } else if(DAC_ALIGN_8B_R == dac_align && NOT_DAC_R8DATA_RANGE(data)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000A), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* DAC_OUT0 data alignment */
        if(DAC_OUT0 == dac_out){
            switch(dac_align){
            /* 12-bit right-aligned data */
            case DAC_ALIGN_12B_R:
                DAC_OUT0_R12DH(dac_periph) = data;
                break;
            /* 12-bit left-aligned data */
            case DAC_ALIGN_12B_L:
                DAC_OUT0_L12DH(dac_periph) = data;
                break;
            /* 8-bit right-aligned data */
            case DAC_ALIGN_8B_R:
                DAC_OUT0_R8DH(dac_periph) = data;
                break;
            default:
                break;
            }
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      enable DAC trigger (API_ID(0x000BU))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_out: DAC_OUTx(x=0)
    \param[out] none
    \retval     none
*/
void dac_trigger_enable(uint32_t dac_periph, uint8_t dac_out)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000B), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            DAC_CTL0(dac_periph) |= (uint32_t)DAC_CTL0_DTEN0;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      disable DAC trigger (API_ID(0x000CU))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_out: DAC_OUTx(x=0)
    \param[out] none
    \retval     none
*/
void dac_trigger_disable(uint32_t dac_periph, uint8_t dac_out)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000C), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DTEN0);
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure DAC trigger source (API_ID(0x000DU))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_out: DAC_OUTx(x=0)
    \param[in]  triggersource: external trigger of DAC
                only one parameter can be selected which is shown as below:
      \arg        DAC_TRIGGER_EXTERNAL: TRIGSEL trigger
      \arg        DAC_TRIGGER_SOFTWARE: software trigger
    \param[out] none
    \retval     none
*/
void dac_trigger_source_config(uint32_t dac_periph, uint8_t dac_out, uint32_t triggersource)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000D), ERR_PERIPH);
    } else if(NOT_DAC_TRIGGER(triggersource)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000D), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            /* configure DACx_OUT0 trigger source */
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DTSEL0);
            DAC_CTL0(dac_periph) |= triggersource;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      enable DAC software trigger (API_ID(0x000EU))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_out: DAC_OUTx(x=0)
    \retval     none
*/
void dac_software_trigger_enable(uint32_t dac_periph, uint8_t dac_out)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000E), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            DAC_SWT(dac_periph) |= (uint32_t)DAC_SWT_SWTR0;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure DAC wave mode (API_ID(0x000FU))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_out: DAC_OUTx(x=0)
    \param[in]  wave_mode: DAC wave mode
                only one parameter can be selected which is shown as below:
      \arg        DAC_WAVE_DISABLE: wave mode disable
      \arg        DAC_WAVE_MODE_LFSR: LFSR noise mode
      \arg        DAC_WAVE_MODE_TRIANGLE: triangle noise mode
    \param[out] none
    \retval     none
*/
void dac_wave_mode_config(uint32_t dac_periph, uint8_t dac_out, uint32_t wave_mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000F), ERR_PERIPH);
    } else if(NOT_DAC_WAVE_MODE(wave_mode)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x000F), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            /* configure DACx_OUT0 wave mode */
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DWM0);
            DAC_CTL0(dac_periph) |= wave_mode;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure DAC LFSR noise mode (API_ID(0x0010U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_out: DAC_OUTx(x=0)
    \param[in]  unmask_bits: LFSR noise unmask bits
                only one parameter can be selected which is shown as below:
      \arg        DAC_LFSR_BIT0: unmask the LFSR bit0
      \arg        DAC_LFSR_BITS1_0: unmask the LFSR bits[1:0]
      \arg        DAC_LFSR_BITS2_0: unmask the LFSR bits[2:0]
      \arg        DAC_LFSR_BITS3_0: unmask the LFSR bits[3:0]
      \arg        DAC_LFSR_BITS4_0: unmask the LFSR bits[4:0]
      \arg        DAC_LFSR_BITS5_0: unmask the LFSR bits[5:0]
      \arg        DAC_LFSR_BITS6_0: unmask the LFSR bits[6:0]
      \arg        DAC_LFSR_BITS7_0: unmask the LFSR bits[7:0]
      \arg        DAC_LFSR_BITS8_0: unmask the LFSR bits[8:0]
      \arg        DAC_LFSR_BITS9_0: unmask the LFSR bits[9:0]
      \arg        DAC_LFSR_BITS10_0: unmask the LFSR bits[10:0]
      \arg        DAC_LFSR_BITS11_0: unmask the LFSR bits[11:0]
    \param[out] none
    \retval     none
*/
void dac_lfsr_noise_config(uint32_t dac_periph, uint8_t dac_out, uint32_t unmask_bits)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0010), ERR_PERIPH);
    } else if(NOT_DAC_LFSR_MODE(unmask_bits)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0010), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            /* configure DACx_OUT0 LFSR noise mode */
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DWBW0);
            DAC_CTL0(dac_periph) |= unmask_bits;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure DAC triangle noise mode (API_ID(0x0011U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_out: DAC_OUTx(x=0)
    \param[in]  amplitude: the amplitude of the triangle
                only one parameter can be selected which is shown as below:
      \arg        DAC_TRIANGLE_AMPLITUDE_1: triangle amplitude is 1
      \arg        DAC_TRIANGLE_AMPLITUDE_3: triangle amplitude is 3
      \arg        DAC_TRIANGLE_AMPLITUDE_7: triangle amplitude is 7
      \arg        DAC_TRIANGLE_AMPLITUDE_15: triangle amplitude is 15
      \arg        DAC_TRIANGLE_AMPLITUDE_31: triangle amplitude is 31
      \arg        DAC_TRIANGLE_AMPLITUDE_63: triangle amplitude is 63
      \arg        DAC_TRIANGLE_AMPLITUDE_127: triangle amplitude is 127
      \arg        DAC_TRIANGLE_AMPLITUDE_255: triangle amplitude is 255
      \arg        DAC_TRIANGLE_AMPLITUDE_511: triangle amplitude is 511
      \arg        DAC_TRIANGLE_AMPLITUDE_1023: triangle amplitude is 1023
      \arg        DAC_TRIANGLE_AMPLITUDE_2047: triangle amplitude is 2047
      \arg        DAC_TRIANGLE_AMPLITUDE_4095: triangle amplitude is 4095
    \param[out] none
    \retval     none
*/
void dac_triangle_noise_config(uint32_t dac_periph, uint8_t dac_out, uint32_t amplitude)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0011), ERR_PERIPH);
    } else if(NOT_DAC_TRIANGLE_AMPL(amplitude)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0011), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DAC_OUT0 == dac_out){
            /* configure DACx_OUT0 triangle noise mode */
            DAC_CTL0(dac_periph) &= (uint32_t)(~DAC_CTL0_DWBW0);
            DAC_CTL0(dac_periph) |= amplitude;
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      enable DAC loop test (API_ID(0x0012U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[out] none
    \retval     none
*/
void dac_loop_test_enable(uint32_t dac_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0012), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DAC_LTCTL(dac_periph) |= (uint32_t)DAC_LTCTL_LTEN;
    }
}

/*!
    \brief      disable DAC loop test (API_ID(0x0013U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[out] none
    \retval     none
*/
void dac_loop_test_disable(uint32_t dac_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0013), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DAC_LTCTL(dac_periph) &= ~(uint32_t)DAC_LTCTL_LTEN;
    }
}

/*!
    \brief      DAC loop test FIFO flush (API_ID(0x0014U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[out] none
    \retval     none
*/
void dac_loop_test_fifo_flush(uint32_t dac_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0014), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DAC_LTCTL(dac_periph) |= (uint32_t)DAC_LTCTL_LTFF;
    }
}

/*!
    \brief      configure DAC loop test wait time (API_ID(0x0015U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_looptest_wait_time: 0x00~0xFF
    \param[out] none
    \retval     none
*/
void dac_loop_test_wait_time(uint32_t dac_periph, uint8_t dac_looptest_wait_time)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0015), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DAC_LTCTL(dac_periph) &= ~(uint32_t)(DAC_LTCTL_LTWT); 
        DAC_LTCTL(dac_periph) |= (uint32_t)((((uint32_t)dac_looptest_wait_time) & DAC_WATI_TIME_MASK) << 16U);
    }
}

/*!
    \brief      get the remaining number of loop test pattern to be converted (API_ID(0x0016U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[out] none
    \retval     the remaining number:0x0~0x8
*/
uint16_t dac_loop_test_remaining_number_read(uint32_t dac_periph)
{
    uint16_t lpnum = 0;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0016), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        lpnum = (uint16_t)((DAC_LTCTL(dac_periph) & DAC_LTCTL_LTCNUM)>>28);
    }
   return (lpnum);
}

/*!
    \brief      write loop test pattern in to FIFO (API_ID(0x0017U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  dac_looptest_pattern: 0x000~0xFFF
    \param[out] none
    \retval     none
*/
void dac_loop_test_pattern(uint32_t dac_periph, uint32_t dac_looptest_pattern)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0017), ERR_PERIPH);
    } else if(NOT_DAC_LPTEST_PATTERN(dac_looptest_pattern)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0017), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        DAC_LTPAT(dac_periph) = (uint32_t)(dac_looptest_pattern);
    }
}

/*!
    \brief      get the DAC flag (API_ID(0x0018U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  flag: the DAC status flags, only one parameter can be selected which is shown
                as below:
      \arg        DAC_FLAG_LTOVIF: loop test overflow interrupt flag
      \arg        DAC_FLAG_LTDIF: loop test done interrupt flag
      \arg        DAC_FLAG_DDUDR0: DACx_OUT0 DMA underrun flag
    \param[out] none
    \retval     the state of DAC bit(SET or RESET)
*/
FlagStatus dac_flag_get(uint32_t dac_periph, uint32_t flag)
{
    FlagStatus reval = RESET;
    uint32_t reg;
    
