sorosaulong-ux/gd32-test-project/Library/gd32a7xx_dac.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0018), ERR_PERIPH);
    } else if(NOT_DAC_FLAG(flag)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0018), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = DAC_STAT0(dac_periph);
        if((0U != (flag & DAC_STAT_FLAG_MASK0)) && (0U != (reg & flag))){
            /* check DAC_STAT0 flag */
            reval = SET;
        } else {
            /* illegal parameters */
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      clear the DAC flag (API_ID(0x0019U))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  flag: DAC flag
                only one parameter can be selected which is shown as below:
      \arg        DAC_FLAG_LTOVIF: loop test overflow interrupt flag
      \arg        DAC_FLAG_LTDIF: loop test done interrupt flag
      \arg        DAC_FLAG_DDUDR0: DACx_OUT0 DMA underrun flag
    \param[out] none
    \retval     none
*/
void dac_flag_clear(uint32_t dac_periph, uint32_t flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x0019), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (flag & DAC_STAT_FLAG_MASK0)){
            /* check DAC_STAT0 flag */
            DAC_STAT0(dac_periph) = (uint32_t)(flag & DAC_STAT_FLAG_MASK0);
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      enable DAC interrupt (API_ID(0x001AU))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  interrupt: the DAC interrupt
                only one parameter can be selected which is shown as below:
      \arg        DAC_INT_LTOVIF: loop test overflow interrupt
      \arg        DAC_INT_LTDIF: loop test done interrupt
      \arg        DAC_INT_DDUDR0: DACx_OUT0 DMA underrun interrupt     
    \param[out] none
    \retval     none
*/
void dac_interrupt_enable(uint32_t dac_periph, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x001A), ERR_PERIPH);
    } else if(NOT_DAC_INT(interrupt)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x001A), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (interrupt & DAC_INT_EN_MASK0)){
            /* enable underrun interrupt */
            DAC_CTL0(dac_periph) |= (uint32_t)(interrupt & DAC_INT_EN_MASK0);
        } else {
            /* illegal parameters */
        }
        
        if(0U != (interrupt & DAC_INT_EN_MASK1)){
            /* enable loop test done and overflow interrupt */
            DAC_LTCTL(dac_periph) |= (uint32_t)(interrupt & DAC_INT_EN_MASK1);
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      disable DAC interrupt (API_ID(0x001BU))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  interrupt: the DAC interrupt
                only one parameter can be selected which is shown as below:
      \arg        DAC_INT_LTOVIF: loop test overflow interrupt
      \arg        DAC_INT_LTDIF: loop test done interrupt
      \arg        DAC_INT_DDUDR0: DACx_OUT0 DMA underrun interrupt
    \param[out] none
    \retval     none
*/
void dac_interrupt_disable(uint32_t dac_periph, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x001B), ERR_PERIPH);
    } else if(NOT_DAC_INT(interrupt)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x001B), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (interrupt & DAC_INT_EN_MASK0)){
            /* disable underrun interrupt */
            DAC_CTL0(dac_periph) &= (uint32_t)(~(interrupt & DAC_INT_EN_MASK0));
        } else {
            /* illegal parameters */
        }
        
        if(0U != (interrupt & DAC_INT_EN_MASK1)){
            /* disable loop test done and overflow interrupt */
            DAC_LTCTL(dac_periph) &= (uint32_t)(~(interrupt & DAC_INT_EN_MASK1));
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      get the DAC interrupt flag (API_ID(0x001CU))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  int_flag: DAC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        DAC_INT_FLAG_LTOVIF: loop test overflow interrupt flag
      \arg        DAC_INT_FLAG_LTDIF: loop test done interrupt flag
      \arg        DAC_INT_FLAG_DDUDR0: DACx_OUT0 DMA underrun interrupt flag
    \param[out] none
    \retval     the state of DAC interrupt flag(SET or RESET)
*/
FlagStatus dac_interrupt_flag_get(uint32_t dac_periph, uint32_t int_flag)
{
    uint32_t reg1 = 0U, reg2 = 0U;
    FlagStatus reval = RESET;
    
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x001C), ERR_PERIPH);
    } else if(NOT_DAC_INT_FLAG(int_flag)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x001C), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (int_flag & DAC_INT_FLAG_MASK0)){
            /* check underrun interrupt int_flag */
            reg1 = DAC_STAT0(dac_periph) & int_flag;
            reg2 = DAC_CTL0(dac_periph) & int_flag;
        } else {
            /* illegal parameters */
        }
        
        if(0U != (int_flag & DAC_INT_FLAG_MASK1)){
            /* check loop test done and overflow int_flag */
            reg1 = DAC_STAT0(dac_periph) & int_flag;
            reg2 = DAC_LTCTL(dac_periph) & int_flag;
        } else {
            /* illegal parameters */
        }

        /*get DAC interrupt flag status */
        if((0U != reg1) && (0U != reg2)){
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    
    return reval;
}

/*!
    \brief      clear the DAC interrupt flag (API_ID(0x001DU))
    \param[in]  dac_periph: DACx(x=0, 1)
    \param[in]  int_flag: DAC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        DAC_INT_FLAG_LTOVIF: loop test overflow interrupt flag
      \arg        DAC_INT_FLAG_LTDIF: loop test done interrupt flag
      \arg        DAC_INT_FLAG_DDUDR0: DACx_OUT0 DMA underrun interrupt flag
    \param[out] none
    \retval     none
*/
void dac_interrupt_flag_clear(uint32_t dac_periph, uint32_t int_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_DAC_PERIPH(dac_periph)){
        fw_debug_report_err(DAC_MODULE_ID, API_ID(0x001D), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* clear underrun interrupt int_flag */
        if(0U != (int_flag & (DAC_INT_FLAG_MASK0 | DAC_INT_FLAG_MASK1))){
            DAC_STAT0(dac_periph) = (uint32_t)(int_flag & (DAC_INT_FLAG_MASK0 | DAC_INT_FLAG_MASK1));
        } else {
            /* illegal parameters */
        }
    }
}
